// Играет пользователь с компьтером
// человек вводит prompt камень ножницы или бумага
// после этого выводится алерт в котором написан выбор компа
// компьтер выбрал ножницы вы проиграли, 2 пользователь : 1 компьютер
// если одно и то же, то выводим ничья
// игра должна длиться до 10 побед любого из участников 
// после того как кто либо из участников достингает 10 ти побед вывести финального победителя
// новая игра
// 0 1 2 - камень ножницы бумага
// Math.random() * 2 тогда рандом будет от 0 до 2 
// Math.round() отбросить дробную часть 
// Math.round(Math.random() * 2)

