// 1. Пользователь вводит год своего рождения
// вывести в консоль инфу сколько пользователю было в разные года до текущего
// например: 
// вводим 2003:
// выводим: в 2003 было 1 год
// в 2004 было 2 год
// в 2005 было 3 год 
// и тд
// в 2022 было 19 год

// let age = prompt('enter date of your berthday!');
// let newAge = 0;
// for (;age <= 2022;age++){
//   newAge++;
//   console.log(`${age} born- ${newAge} now`);
// }

// 2. Пользователь вводит свой возраст. Вывести в консоль 
// сколько лет юудет пользователю каждый год до 2030
// например вводим 14:
// выводим:
// в 2023 будет 15
// в 2024 будет 16
// и тд
// в 2030 будет 22

// 3. Пользователя спрашивают пароль
// если пароль введен неправильно, спрашивать еще раз
// если правильно вывести "добро пожаловать"
// если отмена вывести "вход отменен"

// Здравствуйте все равно не получается... D  этом варианте все вроде логично и правильно , цикл будет выполняться пока пароли не совпадут , но я не могу понять почему он не останавливается  после ввода верного  и не срабатывает

// console.log('fsdfs0');
// let pass = prompt('Enter your password');
// let truePass = '1986';
// for(;;){
  

//   if(pass === null) {
//     console.log('you canceled');
//     break;
//   } 
//   if(pass === truePass) {
//   alert('Hello Tima');
//   break;
//   } else if(pass !== truePass){
//    pass = prompt('Enter your password');
//   }
  
// }

// В этом варианте все проходит как нужно, но только если пользователь вводит один раз неверно , а если второй раз то прекращается вывод поля pass. Как сделать так чтобы это  поле отрабатывало пока верный не введут?

// 


// 4. Пользователь вводит число n, вывести на экран все четные числа от 1 до n

// let userNumber = +prompt("enter number");
// for (i = 1; i < userNumber; i++) {
//   if (i % 2 === 0) {
//     console.log(i);
//   }
// }

