// сформировать массив чисел, которые делятся на 3 (число элементов 8)

// const arr = [];
// let numberArr = 0

// for( i = 1; arr.length < 8; i++){
//     if( i %3 === 0){
//         arr[numberArr] = i;
//         numberArr++;
// }
// }
// console.log(arr);

// Создать с помощью цикла массив, каждый элемент которого равен
//  квадрату своего номера.

// const arr = [];
// let numberArr = 0

// for( i = 1 ; arr.length < 10; i++){
    
//         arr[numberArr] = i*i;
//         numberArr++;
    
// }
// console.log(arr);

// Создать с помощью цикла массив, который одинаково читается как слева 
// направо, так и спаво налево (9)

// const arr = [];

// for( i = 0 ; arr.length < 9; i++){
    
//           if( i % 2 === 0){
//                 arr[i] = 2;
//         } else {
//                 arr[i] = 1;
//         }   
// }
// console.log(arr);


// Создать массив из 10 чисел.Вывести на экраны 
// кол-во четных чисел из этого массива.
// шо та не так не работает!
// const arr = [ 2, 5, 54, 41, 98, 10, 63, 87, 88, 90, 101];
// // let evenNumber = 0;
// for( i = 0 ; arr.length < 10 ; i++){
    
//         if( arr[i] % 2 === 0){
                 
            
//         }
//     }
//     console.log(arr[i]);

// Создать массив из 10 чисел.Вывести на экраны 
// наибольшее число из этого массива.
