// 1. Создать массив из 10ти элементов и вывести на 
// экран сумму всех элементов массива.

// const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// let sum = 0;

// for (let i = 0; i < arr.length; i++) {
//     sum += arr[i];
// }

// console.log(sum);

// 2. Найти среднее арифметическое значение 
// элементов массива, которые стоят на четных местах.

// const arr = [3, 88, 6, 116, 22, 778, 32, 988];

// let sum = 0;
// let avg = 0;

// for (let i = 0; i < arr.length; i++) {
//     if (i % 2 === 0) {
//         sum += arr[i];
//         avg++;
//     }
// }

// console.log(sum / avg);

// 3. Создать массив, элементы которого равны 
// элементам исходного массива, но с 
// противоположными знаками. (Длина исходного 
// массива должна быть не меньше 10ти элементов)

// const arr = [3, -6, 8, -15, 9, -30, 80, -65, 77, -19];

// const reversedArr = [];


// for (let i = 0; i < arr.length; i++) {
//     reversedArr[i] = -arr[i];
// }


// console.log(arr);
// console.log(reversedArr);