// Автоматически заполнить массив нулями, кроме первого и последнего элементов, которые должны быть единицами. (Количество элементов массива: 8)

// const arr = [];
// for (let i = 0; arr.length !== 8; i++) {
//   if (i=== 0 || i === 7) {
//     arr[i] = 1; 
//   } else { 
//     arr[i] = 0;
//   }
  
// }
// console.log(arr);

// Заполнить массив нулями и единицами, при этом данные значения чередуются, начиная с нуля.

// const arr = [];
// for (i = 0; arr.length < 10;i++){
//   arr[i] = i % 2 === 0 ? 0 : 1;

// }
// console.log(arr);

// Сформировать массив из чисел, которые делятся на 3 (Количество элементов массива: 8)

// const arr = [];
// for (let i = 1; arr.length !== 8; i++){
//   arr[arr.length] = i*3;
//   }
//   console.log(arr);

// С помощью цикла создать массив, каждый элемент которого равен квадрату своего номера

// const arr = [];
// for (let i = 2; arr.length !== 10; i++){
//   arr[i] = i*i;
  
// }
// console.log(arr);

// Создать массив из 10 чисел. Вывести на экран количество четных чисел из этого массива.

// const arr = [34,3,4,34,3,45,43,52,34,1];

// for (let i = 0; i !==10; i++){
//   if (arr[i] % 2 === 0){
//     console.log(arr[i]);
//   } else {}
// }

//  Создать массив из 10 чисел. Вывести на экран наибольшее число из этого массива.

// const arr = [5,69,84,509,348,590,37,420,70];
// let maxNum = arr[0];
// for (let i = 0; arr.length > i; i++) {
//   if ( arr[i] > maxNum ) {
//     maxNum = arr[i];
//   } else {
