// Автоматически заполнить массив нулями, кроме первого и последнего элементов, которые должны быть единицами. (Количество элементов массива: 8)

// const arr = [];
// for (let i = 0; arr.length !== 8; i++) {
//   if (i=== 0 || i === 7) {
//     arr[i] = 1; 
//   } else { 
//     arr[i] = 0;
//   }
  
// }
// console.log(arr);

// Заполнить массив нулями и единицами, при этом данные значения чередуются, начиная с нуля.

// const arr = [];
// for (i = 0; arr.length < 10;i++){
//   arr[i] = i % 2 === 0 ? 0 : 1;

// }
// console.log(arr);

// Сформировать массив из чисел, которые делятся на 3 (Количество элементов массива: 8)

// const arr = [];
// for (let i = 1; arr.length !== 8; i++){
//   arr[arr.length] = i*3;
//   }
//   console.log(arr);

// С помощью цикла создать массив, каждый элемент которого равен квадрату своего номера

// const arr = [];
// for (let i = 2; arr.length !== 10; i++){
//   arr[i] = i*i;
  
// }
// console.log(arr);

